package com.nyist.xu.xiaozhao.bianlifeng20;

/**
 * @program: nyist.test
 * @description
 * @author: xu1
 * @create: 2020-09-18 18:31
 **/
public class Logic1 {
    //便利蜂  直接就3道 编程题目

    //多余的连接”第一题的输入描述补充：二维数组，由中括号和逗号组成，最外层也有一个中括号，具体见示例。

    //多余的连接
    //时间限制： 3000MS
    //内存限制： 589824KB
    //题目描述：
    //假设我们有一个连通的无向图，里面可能最多存在一个环，检测输入的图是否有环。
    //
    //这个图有n个不重复的顶点，输入的图的边[a,b]，满足a<b。如果有环输出Y，否则输出N。
    //
    //n表示输入数组的长度，数组里每个数字都小于n。 (n<=10000)
    //
    //1--2–3
    //
    //    |    |
    //
    //   5–4
    //
    //如上图，2-3-4-5是一个环
    //
    //
    //
    //输入描述
    //二维数组，由中括号和逗号组成，最外层也有一个中括号，具体见示例。
    //
    //输出描述
    //返回：Y or N
    //
    //
    //样例输入
    //[[1,2],[2,3],[3,4],[4,5],[2,5]]
    //样例输出
    //Y
    //
    //提示
    //样例 2：
    //输入：
    //[[1,2],[2,3],[3,4],[4,5]]
    //输出：
    //N

}
